nicolas-codemate/esp32-pixelcast/src/main.cpp
    <section>
        <h2>Download from LaMetric</h2>
        <input type="number" id="lmId" placeholder="Icon ID (e.g. 2867)">
        <input type="text" id="lmName" placeholder="Save as (optional)">
        <button onclick="downloadLM()" id="lmBtn">Download</button>
        <a href="https://developer.lametric.com/icons" target="_blank">Browse LaMetric Icons</a>
    </section>

    <section>
        <h2>Icon Gallery</h2>
        <div id="gallery" class="grid"></div>
        <div id="storage" class="storage"></div>
    </section>

    <script>
        function showMsg(text, isError) {
            const el = document.getElementById('msg');
            el.textContent = text;
            el.className = 'msg ' + (isError ? 'error' : 'success');
            setTimeout(() => el.className = 'msg', 3000);
        }

        async function load() {
            try {
                const r = await fetch('/api/icons');
                const d = await r.json();
                document.getElementById('gallery').innerHTML = d.icons.length ? d.icons.map(i => `
                    <div class="icon">
                        <button onclick="del('${i.name}')" title="Delete">X</button>
                        <img src="/api/icons/${i.name}" onerror="this.src='data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7'">
                        <div class="name">${i.name}</div>
                        <div class="size">${i.size}B</div>
                    </div>
                `).join('') : '<p style="color:#666">No icons uploaded yet</p>';
                document.getElementById('storage').innerHTML = `Storage: ${d.storage.used} / ${d.storage.total} bytes (${Math.round(d.storage.used/d.storage.total*100)}%)`;
            } catch(e) {
                showMsg('Failed to load icons: ' + e.message, true);
            }
        }

        async function upload() {
            const name = document.getElementById('name').value.trim();
            const file = document.getElementById('file').files[0];
            if (!name) { showMsg('Please enter icon name', true); return; }
            if (!file) { showMsg('Please select a file', true); return; }
            if (file.size > 8192) { showMsg('File too large (max 8KB)', true); return; }

            document.getElementById('uploadBtn').disabled = true;
            try {
                const fd = new FormData();
                fd.append('file', file);
                const r = await fetch('/api/icons?name=' + encodeURIComponent(name), {method: 'POST', body: fd});
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon uploaded successfully', false);
                    document.getElementById('name').value = '';
                    document.getElementById('file').value = '';
                    load();
                } else {
                    showMsg(d.error || 'Upload failed', true);
                }
            } catch(e) {
                showMsg('Upload error: ' + e.message, true);
            }
            document.getElementById('uploadBtn').disabled = false;
        }

        async function downloadLM() {
            const id = parseInt(document.getElementById('lmId').value);
            const name = document.getElementById('lmName').value.trim() || String(id);
            if (!id) { showMsg('Please enter LaMetric icon ID', true); return; }

            document.getElementById('lmBtn').disabled = true;
            try {
                const r = await fetch('/api/icons/lametric', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({id: id, name: name})
                });
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon downloaded from LaMetric', false);
                    document.getElementById('lmId').value = '';
                    document.getElementById('lmName').value = '';
                    load();
                } else {
                    showMsg(d.error || 'Download failed', true);
                }
            } catch(e) {
                showMsg('Download error: ' + e.message, true);
            }
            document.getElementById('lmBtn').disabled = false;
        }

        async function del(name) {
            if (!confirm('Delete icon "' + name + '"?')) return;
            try {
                const r = await fetch('/api/icons?name=' + encodeURIComponent(name), {method: 'DELETE'});
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon deleted', false);
                    load();
                } else {
                    showMsg(d.error || 'Delete failed', true);
                }
            } catch(e) {
                showMsg('Delete error: ' + e.message, true);
            }
        }

        load();
    </script>
</body>
</html>
)rawliteral";

// ============================================================================
// Function Prototypes
// ============================================================================

void setupDisplay();
void setupWiFi();
void setupMDNS();
void setupWebServer();
void setupMQTT();
void setupFilesystem();
void setupApps();

void loopWiFi();
void loopMQTT();
void loopDisplay();
void loopTime();
void loopApps();

void displayShowBoot();
void displayShowIP();
void displayShowTime();
void displayShowDate();
void displayShowApp(AppItem* app);
void displayClear();
void displaySetBrightness(uint8_t brightness);

int16_t calculateTextWidth(const char* text);
bool textNeedsScroll(const char* text, int16_t availableWidth);
void resetScrollState();

int pngDrawCallback(PNGDRAW *pDraw);
CachedIcon* loadIcon(const char* name);
CachedIcon* getIcon(const char* name);
int8_t findLRUSlot();
void drawIcon(CachedIcon* icon, int16_t x, int16_t y);
void initIconCache();
void invalidateCachedIcon(const char* name);
bool validatePngHeader(const uint8_t* data, size_t len);
bool validateGifHeader(const uint8_t* data, size_t len);
bool downloadLaMetricIcon(uint32_t iconId, const char* saveName);
void handleApiIconsList(AsyncWebServerRequest *request);
void handleApiIconsServe(AsyncWebServerRequest *request, const String& name);
void handleApiIconsDelete(AsyncWebServerRequest *request);

bool loadSettings();
bool saveSettings();
void initDefaultSettings();
bool ensureDirectories();
bool loadApps();
bool saveApps();

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint32_t bgColor,
              uint16_t duration, uint32_t lifetime, int8_t priority, bool isSystem);
bool appRemove(const char* id);
bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor, uint32_t bgColor);
int8_t appFind(const char* id);
void appCleanExpired();
AppItem* appGetNext();
AppItem* appGetCurrent();

