nicolas-codemate/esp32-pixelcast/src/main.cpp
    int textWidth = 60;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(dateStr);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowApp(AppItem* app) {
    if (!app) return;

    // Handle system apps
    if (strcmp(app->id, "clock") == 0) {
        displayShowTime();
        return;
    }

    if (strcmp(app->id, "date") == 0) {
        displayShowDate();
        return;
    }

    // Custom apps
    dma_display->clearScreen();

    // Background color
    if (app->backgroundColor != 0) {
        uint8_t br = (app->backgroundColor >> 16) & 0xFF;
        uint8_t bg = (app->backgroundColor >> 8) & 0xFF;
        uint8_t bb = app->backgroundColor & 0xFF;
        dma_display->fillScreen(dma_display->color565(br, bg, bb));
    }

    // Layout calculation
    // +----------64px-----------+
    // | Icon  |    Text Area    |
    // | 32x32 |  (scrollable)   |
    // +-------------------------+

    int16_t textAreaX = 2;
    int16_t textAreaWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
    int16_t yPos = 28;  // Vertically centered for 64px panel (text baseline)

    // Try to load icon if specified
    CachedIcon* icon = nullptr;
    if (strlen(app->icon) > 0) {
        icon = getIcon(app->icon);
    }

    // Adjust layout if icon is present
    if (icon && icon->valid) {
        // Draw icon vertically centered on the left
        int16_t iconX = 2;
        int16_t iconY = (DISPLAY_HEIGHT - icon->height) / 2;
        drawIcon(icon, iconX, iconY);

        // Text area starts after icon + gap
        textAreaX = iconX + icon->width + 4;  // 4px gap after icon
        textAreaWidth = DISPLAY_WIDTH - textAreaX - 2;  // 2px right margin
    }

    // Text color
    uint8_t r = (app->textColor >> 16) & 0xFF;
    uint8_t g = (app->textColor >> 8) & 0xFF;
    uint8_t b = app->textColor & 0xFF;
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    // Calculate text width and check if scrolling needed
    int16_t textWidth = calculateTextWidth(app->text);
    bool needsScroll = textWidth > textAreaWidth;

    // Update scroll state if this is new text or scroll requirements changed
    if (appScrollState.textWidth != textWidth || appScrollState.availableWidth != textAreaWidth) {
        appScrollState.textWidth = textWidth;
        appScrollState.availableWidth = textAreaWidth;
        appScrollState.needsScroll = needsScroll;
        if (!needsScroll) {
            appScrollState.scrollOffset = 0;
            appScrollState.scrollPhase = 0;
        }
    }

    // Calculate x position with scroll offset
    int16_t xPos = textAreaX;
    if (needsScroll) {
        xPos = textAreaX - appScrollState.scrollOffset;
    }

    // Draw text (clipping handled by display library)
    dma_display->setCursor(xPos, yPos);
    dma_display->print(app->text);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayClear() {
    dma_display->clearScreen();
    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displaySetBrightness(uint8_t brightness) {
    currentBrightness = constrain(brightness, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    dma_display->setBrightness8(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);
}

int16_t calculateTextWidth(const char* text) {
    // Default 5x7 font with 1px spacing = 6 pixels per character
    return strlen(text) * 6;
}

bool textNeedsScroll(const char* text, int16_t availableWidth) {
    return calculateTextWidth(text) > availableWidth;
}

void resetScrollState() {
    appScrollState.scrollOffset = 0;
    appScrollState.lastScrollTime = millis();
    appScrollState.scrollPhase = 0;  // Start with pause
    appScrollState.needsScroll = false;
    appScrollState.textWidth = 0;
    appScrollState.availableWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
}

// ============================================================================
// Icon Functions
// ============================================================================

void initIconCache() {
    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        iconCache[i].name[0] = '\0';
        iconCache[i].pixels = nullptr;
        iconCache[i].width = 0;
        iconCache[i].height = 0;
        iconCache[i].valid = false;
        iconCache[i].lastUsed = 0;
    }
    Serial.println("[ICON] Cache initialized");
}

int pngDrawCallback(PNGDRAW *pDraw) {
    if (!pngDecodeTarget || pDraw->y >= 32) return 1;

    uint16_t* dest = pngDecodeTarget + (pDraw->y * pngDecodeWidth);
    uint16_t pixel;

    for (int x = 0; x < pDraw->iWidth && x < pngDecodeWidth; x++) {
        // Get RGBA values from source
        uint8_t r, g, b, a;
        if (pDraw->iPixelType == PNG_PIXEL_TRUECOLOR_ALPHA || pDraw->iPixelType == PNG_PIXEL_INDEXED) {
            // For RGBA or indexed with alpha
            uint8_t* src = pDraw->pPixels + (x * 4);
            r = src[0];
            g = src[1];
            b = src[2];
            a = src[3];
        } else if (pDraw->iPixelType == PNG_PIXEL_TRUECOLOR) {
            // For RGB without alpha
            uint8_t* src = pDraw->pPixels + (x * 3);
            r = src[0];
            g = src[1];
            b = src[2];
            a = 255;
        } else {
            // Grayscale or other
            r = g = b = pDraw->pPixels[x];
            a = 255;
        }

        // Convert to RGB565
        if (a < 128) {
            pixel = 0;  // Transparent = black
        } else {
            pixel = ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
        }
        dest[x] = pixel;
    }
    return 1;
}

int8_t findLRUSlot() {
    int8_t lruIndex = -1;
    unsigned long oldestTime = UINT32_MAX;

    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        // First check for empty slots
        if (!iconCache[i].valid) {
            return i;
        }
        // Then find least recently used
        if (iconCache[i].lastUsed < oldestTime) {
            oldestTime = iconCache[i].lastUsed;
            lruIndex = i;
        }
    }

